Network details:
trained on 200,000 games (90% for training 10% for validation)
and with 50 epochs
success rate: 0.318
CNet.summary():
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               (None, 14, 14, 32)        320       
_________________________________________________________________
conv2 (Conv2D)               (None, 12, 12, 64)        18496     
_________________________________________________________________
conv3 (Conv2D)               (None, 10, 10, 64)        36928     
_________________________________________________________________
deconv1 (Conv2DTranspose)    (None, 12, 12, 64)        36928     
_________________________________________________________________
deconv2 (Conv2DTranspose)    (None, 14, 14, 64)        36928     
_________________________________________________________________
deconv3 (Conv2DTranspose)    (None, 16, 16, 32)        18464     
_________________________________________________________________
dense1 (Dense)               (None, 16, 16, 1)         33        
=================================================================
Total params: 148,097
Trainable params: 148,097
Non-trainable params: 0